<div>
    <img src="images/emlyon.png" style="height:60px; float:left; padding-right:10px; margin-top:5px" />
    <span>
        <h1 style="padding-bottom:5px;"> AI Booster Week 01 - Python for Data Science </h1>
        <a href="https://masters.em-lyon.com/fr/msc-in-data-science-artificial-intelligence-strategy">[Emlyon]</a> MSc in Data Science & Artificial Intelligence Strategy (DSAIS) <br/>
         Paris | Â© Saeed VARASTEH
    </span>
</div>

<div class="alert-info" style="border-bottom: solid 1px lightgray; background-color:#ece4f5;">
    <img src="images/assignment.png" style="height:60px; float:left; padding-right:10px;" />
    <span style="font-weight:bold; color:#8966b0">
        <h4 style="padding-top:25px;"> EXERCISES 04 </h4>
    </span>
</div>

### Pandas I

In [88]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

__Q1__ Consider the following Python dictionary `data` and Python list `labels`:

``` python
data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
```

**1.** Create a DataFrame `df` from this dictionary `data` which has the index `labels`.

In [89]:
data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

# your code
df = pd.DataFrame(data, index = labels)

In [90]:
df

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

**2.** Display a summary of the basic information about this DataFrame and its data (*hint: there is a single method that can be called on the DataFrame*).

In [91]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   animal    10 non-null     object
 1   age       8 non-null      float64
 2   visits    10 non-null     int64
 3   priority  10 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes

In [92]:
df.describe()

            age     visits
count  8.000000  10.000000
mean   3.437500   1.900000
std    2.007797   0.875595
min    0.500000   1.000000
25%    2.375000   1.000000
50%    3.000000   2.000000
75%    4.625000   2.750000
max    7.000000   3.000000

**3.** Return the first 3 rows of the DataFrame `df`.

In [93]:
df.head(3)

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no

**4.** Select just the 'animal' and 'age' columns from the DataFrame `df`.

In [94]:
df.columns = df.columns.str.replace(" ","")

In [95]:
df.loc[:,['animal','age']]

  animal  age
a    cat  2.5
b    cat  3.0
c  snake  0.5
d    dog  NaN
e    dog  5.0
f    cat  2.0
g  snake  4.5
h    cat  NaN
i    dog  7.0
j    dog  3.0

**5.** Select the data in rows `[3, 4, 8]` *and* in columns `['animal', 'age']`.

In [96]:
df.loc[['c','d','h'],['animal','age']]

  animal  age
c  snake  0.5
d    dog  NaN
h    cat  NaN

**6.** Select only the rows where the number of visits is greater than 3.

In [97]:
mask = df['visits'] >= 3

In [98]:
df.loc[mask]

  animal  age  visits priority
b    cat  3.0       3      yes
d    dog  NaN       3      yes
f    cat  2.0       3       no

**7.** Select the rows where the age is missing, i.e. it is `NaN`.

In [99]:
df.loc[df['age'].isna()]

  animal  age  visits priority
d    dog  NaN       3      yes
h    cat  NaN       1      yes

**8.** Select the rows where the animal is a cat *and* the age is less than 3.

In [100]:
mask2 = (df['animal'] == 'cat' )& (df['age'] < 3)

In [101]:
df.loc[mask2]

  animal  age  visits priority
a    cat  2.5       1      yes
f    cat  2.0       3       no

**9.** Select the rows the age is between 2 and 4 (inclusive).

In [102]:
df.loc[(2<=df['age']) & (df['age']<=4)]

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
f    cat  2.0       3       no
j    dog  3.0       1       no

**10.** Change the age in row 'f' to 1.5.

In [103]:
df.loc[df.index == 'f','age'] = 1.5

**11.** Calculate the sum of all visits in `df` (i.e. the total number of visits).

In [104]:
sum(df.visits)

19

**12.** Calculate the mean age for each different animal in `df`.

In [105]:
cat_age_mean = np.mean(df.loc[df['animal'] == 'cat','age'])

In [106]:
dog_age_mean = np.mean(df.loc[df['animal'] == 'dog','age'])

In [107]:
print(f"cat mean is {cat_age_mean}, dog mean is {dog_age_mean}.")

cat mean is 2.3333333333333335, dog mean is 5.0.

**13.** Append a new row 'k' to `df` with your choice of values for each column. Then delete that row to return the original DataFrame.

In [108]:
row_k = pd.Series({'animal':'cat','age':3.5,'visits':3,'priority':'yes'},name = 'k')
df = df.append(row_k)

C:\Users\chino\AppData\Local\Temp\ipykernel_10660\443173694.py:2: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append(row_k)

In [110]:
df.drop('k')

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  1.5       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

**14.** Count the number of each type of animal in `df`.

In [123]:
df['animal'].value_counts()

cat      5
dog      4
snake    2
Name: animal, dtype: int64

In [121]:
count = df['animal'].value_counts()

In [122]:
count.iloc[0]

5

**15.** Sort `df` first by the values in the 'age' in *decending* order, then by the value in the 'visits' column in *ascending* order (so row `i` should be first, and row `d` should be last).

In [125]:
df.sort_values(by = ['age','visits'],ascending = [False,True])

  animal  age  visits priority
i    dog  7.0       2       no
e    dog  5.0       2       no
g  snake  4.5       1       no
k    cat  3.5       3      yes
j    dog  3.0       1       no
b    cat  3.0       3      yes
a    cat  2.5       1      yes
f    cat  1.5       3       no
c  snake  0.5       2       no
h    cat  NaN       1      yes
d    dog  NaN       3      yes

**16.** The 'priority' column contains the values 'yes' and 'no'. Replace this column with a column of boolean values: 'yes' should be `True` and 'no' should be `False`.

In [126]:
df.priority = df.priority.replace({'yes':True,'no':False})

In [127]:
df.priority

a     True
b     True
c    False
d     True
e    False
f    False
g    False
h     True
i    False
j    False
k     True
Name: priority, dtype: bool

**17.** In the 'animal' column, change the 'snake' entries to 'python'.

In [128]:
df.animal = df.animal.replace({'snake':'python'})

In [129]:
df.animal

a       cat
b       cat
c    python
d       dog
e       dog
f       cat
g    python
h       cat
i       dog
j       dog
k       cat
Name: animal, dtype: object

**18.** For each animal type and each number of visits, find the mean age. In other words, each row is an animal, each column is a number of visits and the values are the mean ages (*hint: use a pivot table*).

In [130]:
df.pivot_table(index = 'animal',columns = 'visits', values = 'age', aggfunc = 'mean')

visits    1    2         3
animal
cat     2.5  NaN  2.666667
dog     3.0  6.0       NaN
python  4.5  0.5       NaN

---